{
	"id": "hwic.theglacier2",
	"name": "The Glacier",
	"version": "0.2.3",
	"authors": "hwic,masro",
	"requirements": [ "slime-cubed.slugbase", "moreslugcats","improved-input-config"],
	"description": "The messenger Slugcat exiled in this land has the ability to control ice, which is the last legacy bestowed upon it by the god.<LINE><LINE>Ability:<LINE>◇ Hold pick-up to transform spear into icespear by consuming one grid of food<LINE>Icespear will freeze and stop the attacking creature, and can be used three times<LINE>◇ The movement speed of creatures approaching you will be slow (the captured creatures are not included in this category)<LINE>◇ Hold down jump in the air to glide for a period of time<LINE>◇Pressing the S to generate an ice shield by consuming three grid of food that can withstand damage once, with a maximum limit of two【Obtain after seeing FP】<LINE>◇Something interesting will happen if you swallow bomb<LINE>◇ Inability to consume scavenger<LINE> ◇Cyan Lizard permanent hate<LINE><LINE>Known issues:<LINE>△ cloak<LINE><LINE>Future plans:<LINE>Add scavenger partners<LINE><LINE>Hwitcold:<LINE>Finally, Glacier is my Slugcatoc and it is not allowed to use this setting for all purposes other than re-creation.<LINE>Part of the art thanks to Vokka and Lucky!<LINE><LINE>Masro:<LINE>I would like to express my gratitude to the creators and friends who have provided me with help and support:<LINE>Thank you to Seron for providing me with guidance on the direction of mod production in his column <Slugbase Beginner's Guide from scratch> on Bilibili.<LINE>Special thanks to Harvie, NuoPu, ShanKa, and QED for providing a lot of code examples and assistance in my module production process,<LINE>Without their help, this module would not have appeared.<LINE><LINE>https://github.com/382500029/TheGlacier-RainWorldMod-<LINE><LINE>2024.2.16 update<LINE>Fixed saving error，Added some options.",
	"requirements_names": [ "SlugBase", "More Slugcat Expansion","Improved Input Config"],
	"tags": [
		"Custom Slugcat"
	  ]
}
